from aiogram import Router, F
from aiogram.fsm.context import FSMContext
from aiogram.types import CallbackQuery, URLInputFile, LabeledPrice, PreCheckoutQuery, InputMediaPhoto, Message

from config import bot
from src.states import UserStates

course_one_router = Router()

@course_one_router.callback_query(UserStates.menu, F.data == "course1")
async def answers(callback_query: CallbackQuery, state: FSMContext):
    await bot.send_photo(
        chat_id=callback_query.from_user.id,
        photo="AgACAgIAAxkBAAICMWk8YUIEVWCNhAqnfFDPaAKJBGT9AAIHGGsbL1noSSiIB3MzBUMnAQADAgADeQADNgQ",
        caption="""Онлайн-курс повышения квалификации «Терапия творчеством» ✨
        
Что вы получите:

Обновите и упорядочите свои знания в консультировании и тренинговой работе 📚
Освоите авторские методики терапии творчеством — проверенные, живые, работающие на 100% 🔥
Научитесь быстро и экологично снимать стресс, тревогу и эмоциональные блоки через творчество 🎨
Добавите в свою копилку крутые инструменты самопомощи, которыми можно пользоваться каждый день 🌟
        """
    )
    await bot.send_message(
        chat_id=callback_query.from_user.id,
        text="""Вы погрузитесь в волшебные методы:

Терапия творческим самовыражением ✍️
Эмоционально-образная терапия (ЭОТ) ❤️
Кинотерапия 🍿
Создание терапевтических метафор с юмором и лёгкостью 😄 
        
Ведут курс — потрясающие авторы и разработчики программы:
👩‍🏫 Грушко Наталья Владимировна — руководитель программы, к.п.н., доцент
👩‍🏫 Карловская Наталья Николаевна — к.п.н., доцент
👩‍🏫 Козлова Дарья Евгеньевна — старший преподаватель
👩‍🏫 Динкелакер Людмила Александровна — старший преподаватель
Кафедра общей и социальной психологии ❤️
После курса вы уйдёте с целым чемоданом новых идей, тёплым сердцем и уверенностью, что помогать можно легко и с улыбкой 🌈
Ждём именно вас! 🚀"""
    )
    invoice_message = await bot.send_invoice(
        chat_id=callback_query.from_user.id,
        title="Модуль 1: «Терапевтическая метафора» (16 ак. часов) 🕊",
        description=f"""Этот курс специально для психологов, коучей, тренеров и всех, кто хочет помогать себе и другим мягко и красиво 🌿""",
        payload="1",
        provider_token="1744374395:TEST:e5d71d19d5c4ad74014a",
        currency='rub',
        prices=[LabeledPrice(label='Курс', amount=360000)],
        start_parameter='Pay',
        need_name=True,
        need_phone_number=True,
        protect_content=True,
        request_timeout=60,
    )


@course_one_router.pre_checkout_query(UserStates.menu)
async def pre_checkout(query: PreCheckoutQuery, state: FSMContext):
    """
    Функция обрабатывает проверку оплаты
    """
    await bot.answer_pre_checkout_query(query.id, ok=True)


@course_one_router.message(F.successful_payment)
async def shipping(message: Message, state: FSMContext):

        await bot.send_message(
            chat_id=message.chat.id,
            text="Спасибо за оплату, вы успешно купили курс"
        )